# Pandas

## Imports

Um mit Pandas arbeiten zu können, muss das Modul geladen werden

In [1]:
import pandas as pd

## Datensätze

Pandas arbeitet mit Datensätzen (DataFrames). Dies können mit dem Konstruktor erzeugt werden:

In [14]:
data = pd.DataFrame({'x1' : [ 0, 1, 2] ,
                     'x2' : [ 3, 4, 5]})
data

   x1  x2
0   0   3
1   1   4
2   2   5

Daten können auch aus Dateien gelesen werden. Einfachste Form: Ascii-Text Tabellenformat. Einlesbar mit:

In [15]:
data = pd.read_csv('data/2d_samples.csv', header=0)

## Selektion der Daten

Ausgabe der ersten 5 Zeilen

In [3]:
data.head()

        x1        x2 Label
0  30.5905  11.30740     A
1  28.6456  10.42340     A
2  28.2756  10.18550     A
3  25.9744   8.50403     A
4  28.5634  10.92670     A

Ausgabe der letzten 5 Zeilen:

In [4]:
data.tail()

           x1        x2 Label
1495  29.6511   9.23666     B
1496  31.9667  10.39530     B
1497  31.4926   9.90862     B
1498  27.8434   8.92265     B
1499  32.8787  10.23770     B

Daten können mit Hilfe der Zeilen und Spaltennummer(n) selektiert werden:

In [5]:
data.iloc[[1,3,8],[0,1]]  # Zeilen 1,3,8 mit Spalten 0 und 1

        x1        x2
1  28.6456  10.42340
3  25.9744   8.50403
8  26.9512   9.28147

Auch Text-Spalten können zur Selektion verwendet werden. Dazu müssen Sie allerdings in einen Index umgewandelt werden:

In [6]:
data.set_index("Label", inplace=True)     # Spalte 'Label' als Index
data.head()

            x1        x2
Label
A      30.5905  11.30740
A      28.6456  10.42340
A      28.2756  10.18550
A      25.9744   8.50403
A      28.5634  10.92670

Die ersten 3 Datensätze mit Label 'A' selektieren:

In [7]:
data.loc['A',['x1', 'x2']].head(3)

            x1       x2
Label
A      30.5905  11.3074
A      28.6456  10.4234
A      28.2756  10.1855

## Umwandlung in NumPy-Array

Die Umwandlung eines Datensatzes in ein NumPy-Array erfolgt mit dem Attribut 'values'

In [13]:
data2 = pd.DataFrame({'x1' : [ 0, 1, 2] ,
                     'x2' : [ 3, 4, 5]})
data2.values

array([[0, 3],
       [1, 4],
       [2, 5]])